analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/wdt_regs.h
/**@} end of group WDT_CTRL_Register */

/**
 * @ingroup  wdt_registers
 * @defgroup WDT_RST WDT_RST
 * @brief    Windowed Watchdog Timer Reset Register.
 * @{
 */
#define MXC_F_WDT_RST_RESET_POS                        0 /**< RST_RESET Position */
#define MXC_F_WDT_RST_RESET                            ((uint32_t)(0xFFUL << MXC_F_WDT_RST_RESET_POS)) /**< RST_RESET Mask */
#define MXC_V_WDT_RST_RESET_SEQ0                       ((uint32_t)0xA5UL) /**< RST_RESET_SEQ0 Value */
#define MXC_S_WDT_RST_RESET_SEQ0                       (MXC_V_WDT_RST_RESET_SEQ0 << MXC_F_WDT_RST_RESET_POS) /**< RST_RESET_SEQ0 Setting */
#define MXC_V_WDT_RST_RESET_SEQ1                       ((uint32_t)0x5AUL) /**< RST_RESET_SEQ1 Value */
#define MXC_S_WDT_RST_RESET_SEQ1                       (MXC_V_WDT_RST_RESET_SEQ1 << MXC_F_WDT_RST_RESET_POS) /**< RST_RESET_SEQ1 Setting */

/**@} end of group WDT_RST_Register */

/**
 * @ingroup  wdt_registers
 * @defgroup WDT_CLKSEL WDT_CLKSEL
 * @brief    Windowed Watchdog Timer Clock Select Register.
 * @{
 */
#define MXC_F_WDT_CLKSEL_SOURCE_POS                    0 /**< CLKSEL_SOURCE Position */
#define MXC_F_WDT_CLKSEL_SOURCE                        ((uint32_t)(0x7UL << MXC_F_WDT_CLKSEL_SOURCE_POS)) /**< CLKSEL_SOURCE Mask */

/**@} end of group WDT_CLKSEL_Register */

/**
 * @ingroup  wdt_registers
 * @defgroup WDT_CNT WDT_CNT
 * @brief    Windowed Watchdog Timer Count Register.
 * @{
 */
#define MXC_F_WDT_CNT_COUNT_POS                        0 /**< CNT_COUNT Position */
#define MXC_F_WDT_CNT_COUNT                            ((uint32_t)(0xFFFFFFFFUL << MXC_F_WDT_CNT_COUNT_POS)) /**< CNT_COUNT Mask */

/**@} end of group WDT_CNT_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32672_INCLUDE_WDT_REGS_H_
